# RadialArrayArcRadius Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RadialArrayArcRadius Property
ParameterTypeId Class See Also
---
"Radius"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RadialArrayArcRadius { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RadialArrayArcRadius As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RadialArrayArcRadius {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace